iwasz/mcuxsdk-middleware-bootloader/src/bootloader/src/bl_command_MKE17Z512.c
#if 0
//! @brief Receive SB File command handler.
void handle_receive_sb_file(uint8_t *packet, uint32_t packetLength)
{
    receive_sb_file_packet_t *command = (receive_sb_file_packet_t *)packet;

    // Start the data phase.
    reset_data_phase();
    g_bootloaderContext.commandInterface->stateData->dataPhase.count = command->byteCount;
    g_bootloaderContext.commandInterface->stateData->dataPhase.commandTag = kCommandTag_ReceiveSbFile;
    send_generic_response(kStatus_Success, command->commandPacket.commandTag);

    // Initialize the SB file loader state machine
    sbloader_init();
}
#endif // if 0

//! @brief Get Property command handler.
void handle_get_property(uint8_t *packet, uint32_t packetLength)
{
    get_property_packet_t *command = (get_property_packet_t *)packet;

    uint32_t *value = NULL;
    uint32_t valueSize = 0;
    status_t status = g_bootloaderContext.propertyInterface->get(command->propertyTag, command->memoryId,
                                                                 (const void **)&value, &valueSize);

    // Make sure the property's size is no more than the size of the max number of return parameters.
    assert(valueSize <= (kMaxPropertyReturnValues * sizeof(uint32_t)));

    // Currently there are no property responses that contain a data phase.
    g_bootloaderContext.commandInterface->stateData->dataPhase.count = 0;
    send_get_property_response(status, value, (valueSize / sizeof(uint32_t)));
}

#if 0
//! @brief Set Property command handler.
void handle_set_property(uint8_t *packet, uint32_t packetLength)
{
    set_property_packet_t *command = (set_property_packet_t *)packet;

    status_t status = g_bootloaderContext.propertyInterface->set_uint32(command->propertyTag, command->propertyValue);

    send_generic_response(status, command->commandPacket.commandTag);
}
#endif // if 0

#if 0
#if BL_FEATURE_QSPI_MODULE || BL_FEATURE_FLEXSPI_NOR_MODULE || BL_FEATURE_SEMC_NOR_MODULE || \
    BL_FEATURE_EXPAND_MEMORY || BL_FEATURE_SPI_NOR_EEPROM_MODULE || BL_FEATURE_SPIFI_NOR_MODULE
//! @brief Configure memory command handler.
void handle_configure_memory(uint8_t *packet, uint32_t packetLength)
{
    configure_memory_packet_t *command = (configure_memory_packet_t *)packet;
    status_t status = kStatus_InvalidArgument;

    status = mem_config(command->flashMemId, (uint32_t *)command->configBlockAddress);

    send_generic_response(status, command->commandPacket.commandTag);
}
#endif // BL_FEATURE_QSPI_MODULE || BL_FEATURE_FLEXSPI_NOR_MODULE || BL_FEATURE_EXPAND_MEMORY ||
       // BL_FEATURE_SPI_NOR_EEPROM_MODULE || BL_FEATURE_SPIFI_NOR_MODULE

#endif // if 0

#if 0
#if BL_FEATURE_QSPI_MODULE
status_t configure_qspi(const uint32_t address)
{
    status_t status = kStatus_Success;

    uint32_t startAddr = address;
    uint32_t endAddr = startAddr + sizeof(qspi_config_t) - 1;

    // Validate parameters.
    if ((!is_valid_application_location(startAddr)) || (!is_valid_application_location(endAddr)))
    {
        status = kStatus_InvalidArgument;
    }

    // Call configure quadspi implementation.
    if (status == kStatus_Success)
    {
        status = quadspi_init((void *)startAddr);
        if (status == kStatus_Success)
        {
            // Re-init memory interface to intialize qspi memory interface
            g_bootloaderContext.memoryInterface->init();
        }
        g_bootloaderContext.propertyInterface->store->qspiInitStatus = status;
    }

    return status;
}
#endif // BL_FEATURE_QSPI_MODULE
#endif // if 0


//! @brief Write Memory command handler.
void handle_write_memory(uint8_t *packet, uint32_t packetLength)
{
    write_memory_packet_t *command = (write_memory_packet_t *)packet;

    // Start the data phase.
    reset_data_phase();
    g_bootloaderContext.commandInterface->stateData->dataPhase.memoryId = command->memoryId;
    g_bootloaderContext.commandInterface->stateData->dataPhase.count = command->byteCount;
    g_bootloaderContext.commandInterface->stateData->dataPhase.address = command->startAddress;
    g_bootloaderContext.commandInterface->stateData->dataPhase.commandTag = kCommandTag_WriteMemory;

    send_generic_response(kStatus_Success, command->commandPacket.commandTag);
}

#if 0
#if BL_FEATURE_GEN_KEYBLOB
#if defined(LEGACY_KEYBLOB_SUPPORT)

#define GEN_KEYBLOB_KEY_SIZE (16) // 128 bit
#define GEN_KEYBLOB_KEY_SIZE_WORD (GEN_KEYBLOB_KEY_SIZE / 4)
#define GEN_KEYBLOB_SIZE (72) // key blob size
static uint32_t key_data[GEN_KEYBLOB_KEY_SIZE_WORD];
static uint8_t key_blob[GEN_KEYBLOB_SIZE];

//! @brief Generate Key Blob command handler.
void handle_generate_key_blob(uint8_t *packet, uint32_t packetLength)
{
    generate_key_blob_packet_t *command = (generate_key_blob_packet_t *)packet;

    // Start the data phase.
    reset_data_phase();
    g_bootloaderContext.commandInterface->stateData->dataPhase.commandTag = kCommandTag_GenerateKeyBlob;
    g_bootloaderContext.commandInterface->stateData->dataPhase.option = command->keyDataPhase;

    if (command->keyDataPhase == 0)
    {
        // receiving DEK key 16 bytes (128bits key)
        g_bootloaderContext.commandInterface->stateData->dataPhase.count = GEN_KEYBLOB_KEY_SIZE;
        g_bootloaderContext.commandInterface->stateData->dataPhase.address = (uint32_t)&key_data[0];

        send_generic_response(kStatus_Success, command->commandPacket.commandTag);
    }
    else
    {
        // generate key blob 72 bytes
        generate_key_blob((uint32_t *)&key_data[0], key_blob);

        g_bootloaderContext.commandInterface->stateData->dataPhase.count = GEN_KEYBLOB_SIZE;
        g_bootloaderContext.commandInterface->stateData->dataPhase.address = (uint32_t)&key_blob[0];

        send_generate_key_blob_response(kStatus_Success, 72);
    }
}

#else /* No LEGACY_KEYBLOB_SUPPORT */
//! @brief Generate Key Blob command handler.
void handle_generate_key_blob(uint8_t *packet, uint32_t packetLength)
{
#if defined(BL_FEATURE_KEYBLOB_DATA_KEY_MAX_SIZE)
    static uint8_t key_data[BL_FEATURE_KEYBLOB_DATA_KEY_MAX_SIZE];
#else // AES-128bit
    static uint8_t key_data[16];
#endif

#if defined(BL_FEATURE_KEYBLOB_BLOB_MAX_SIZE)
    static uint8_t key_blob[BL_FEATURE_KEYBLOB_BLOB_MAX_SIZE];
#else
    static uint8_t key_blob[56 + sizeof(key_data)];
#endif

    static uint32_t key_sel;
    static uint32_t key_size;

    status_t status = kStatus_Fail;

