iwasz/mcuxsdk-middleware-bootloader/src/bootloader/src/bl_command_MKE17Z512.c
    generate_key_blob_packet_t *command = (generate_key_blob_packet_t *)packet;

    // Start the data phase.
    reset_data_phase();
    g_bootloaderContext.commandInterface->stateData->dataPhase.commandTag = kCommandTag_GenerateKeyBlob;
    g_bootloaderContext.commandInterface->stateData->dataPhase.option = command->keyDataPhase;

    if (0 == command->keyDataPhase) // Receiving key
    {
        if (command->keyLength <= sizeof(key_data))
        {
            key_size = command->keyLength;
            key_sel = command->keyAddress;
            g_bootloaderContext.commandInterface->stateData->dataPhase.count = command->keyLength;
            g_bootloaderContext.commandInterface->stateData->dataPhase.address = (uint32_t)key_data;
            g_bootloaderContext.commandInterface->stateData->dataPhase.option = kCmd_DataPhase_Option_Consumer;
            status = kStatus_Success;
        }
        else
        {
            status = kStatus_InvalidArgument;
        }
        send_generic_response(status, command->commandPacket.commandTag);
    }
    else // Sending key blob
    {
        // generate key blob
        uint32_t key_blob_size = 0;
        status = generate_key_blob(key_data, key_size, key_sel, key_blob, &key_blob_size);

        if ((kStatus_Success != status) || (key_blob_size == 0) || (key_blob_size > sizeof key_blob))
        {
            key_blob_size = 0;
        }

        g_bootloaderContext.commandInterface->stateData->dataPhase.count = key_blob_size;
        g_bootloaderContext.commandInterface->stateData->dataPhase.address = (uint32_t)key_blob;
        g_bootloaderContext.commandInterface->stateData->dataPhase.option = kCmd_DataPhase_Option_Producer;

        send_generate_key_blob_response(status, key_blob_size);
    }
}
#endif /* LEGACY_KEYBLOB_SUPPORT */
#endif // BL_FEATURE_GEN_KEYBLOB

#endif // if 0

//! @brief Read Memory command handler.
void handle_read_memory(uint8_t *packet, uint32_t packetLength)
{
    read_memory_packet_t *command = (read_memory_packet_t *)packet;

    // Start the data phase.
    reset_data_phase();
    g_bootloaderContext.commandInterface->stateData->dataPhase.memoryId = command->memoryId;
    g_bootloaderContext.commandInterface->stateData->dataPhase.count = command->byteCount;
    g_bootloaderContext.commandInterface->stateData->dataPhase.address = command->startAddress;
    g_bootloaderContext.commandInterface->stateData->dataPhase.commandTag = kCommandTag_ReadMemory;
    send_read_memory_response(kStatus_Success, command->byteCount);
}

//! @brief Complete the data phase, optionally send a response.
void finalize_data_phase(status_t status)
{
    g_bootloaderContext.commandInterface->stateData->dataPhase.address = 0;
    g_bootloaderContext.commandInterface->stateData->dataPhase.count = 0;

    // Force to write cached data to target memory
    if (g_bootloaderContext.commandInterface->stateData->dataPhase.commandTag == kCommandTag_WriteMemory)
    {
        assert(g_bootloaderContext.memoryInterface->flush);
        status_t flushStatus = g_bootloaderContext.memoryInterface->flush();

        // Update status only if the last operation result is successfull in order to reflect
        // real result of the write operation.
        if (status == kStatus_Success)
        {
            status = flushStatus;
        }
    }
#if BL_FEATURE_KEY_PROVISIONING
#if defined(BL_FEATURE_KEY_STORE_PUF) && BL_FEATURE_KEY_STORE_PUF
    if ((status == kStatus_Success) &&
        (g_bootloaderContext.commandInterface->stateData->dataPhase.commandTag == kCommandTag_KeyProvisioning))
    {
        if (g_bootloaderContext.commandInterface->stateData->dataPhase.argument0 ==
            kKeyProvisioning_Operation_SetUserKey)
        {
            status =
                key_store_set_key(s_userKeyBuffer, g_bootloaderContext.commandInterface->stateData->dataPhase.argument2,
                                  g_bootloaderContext.commandInterface->stateData->dataPhase.argument1);
        }
        else if (g_bootloaderContext.commandInterface->stateData->dataPhase.argument0 ==
                 kKeyProvisioning_Operation_WriteKeyStore)
        {
            status = key_store_set(s_userKeyStoreBuffer, sizeof(s_userKeyStoreBuffer));
        }
    }
#else
    if ((status == kStatus_Success) &&
        (g_bootloaderContext.commandInterface->stateData->dataPhase.commandTag == kCommandTag_KeyProvisioning))
    {
        if (g_bootloaderContext.commandInterface->stateData->dataPhase.argument0 ==
            kKeyProvisioning_Operation_SetUserKey)
        {
            skboot_key_metadata_t keyMetaData = { .keyType = kPUF_KeyType_Invalid };
            keyMetaData.keyType =
                (skboot_key_type_t)g_bootloaderContext.commandInterface->stateData->dataPhase.argument1;
            status = skboot_key_secretbox(
                s_userKeyBuffer, g_bootloaderContext.commandInterface->stateData->dataPhase.argument2, &keyMetaData);
            switch (status)
            {
                case kStatus_SKBOOT_Success:
                    status = kStatus_Success;
                    break;
                case kStatus_SKBOOT_Fail:
                    status = kStatus_Fail;
                    break;
                case kStatus_SKBOOT_InvalidArgument:
                    status = kStatus_InvalidArgument;
                    break;
                default:
                    break; // No change.
            }
        }
    }
#endif // BL_FEATURE_KEY_STORE_PUF
#endif // #if BL_FEATURE_KEY_PROVISIONING
#if BL_FEATURE_EXPAND_MEMORY
    // Reset the state machine of memory interface.
    assert(g_bootloaderContext.memoryInterface->finalize);
    status_t finalizeStatus = g_bootloaderContext.memoryInterface->finalize();
    if (status == kStatus_Success)
    {
        status = finalizeStatus;
    }
#endif // BL_FEATURE_EXPAND_MEMORY

    // Send final response packet.
    send_generic_response(status, g_bootloaderContext.commandInterface->stateData->dataPhase.commandTag);

#if !BL_FEATURE_MIN_PROFILE
    if ((status == kStatus_AbortDataPhase) &&
        g_bootloaderContext.commandInterface->stateData->dataPhase.commandTag == kCommandTag_ReceiveSbFile)
    {
        // Aborting due to sb loader jump or reset command.
        // If jump or reset successful, this will not return.
        // In the current architecture there is no way to handle an error return from sbloader_finalize()
        // because we already sent the "abort" status above to indicate that a jump command was encountered.
        sbloader_finalize();
    }
#endif // !BL_FEATURE_MIN_PROFILE
}

