iwasz/mcuxsdk-middleware-bootloader/src/bootloader/src/bl_command_MKE17Z512.c
#if 0
//! @brief Call command handler.
void handle_call(uint8_t *packet, uint32_t packetLength)
{
    execute_call_packet_t *command = (execute_call_packet_t *)packet;
    status_t responseStatus = kStatus_Success;

    // Validate call address.
    if (!is_valid_application_location(command->callAddress))
    {
        // Invalid address, respond with kStatus_InvalidArgument.
        responseStatus = kStatus_InvalidArgument;
    }
    else
    {
        call_function_t callFunction = (call_function_t)command->callAddress;
        shutdown_cleanup(kShutdownType_Cleanup);
        responseStatus = callFunction(command->argumentWord);
    }

    send_generic_response(responseStatus, command->commandPacket.commandTag);
}
#endif // if 0

//#if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
#if BL_FEATURE_FLASH_SECURITY
//! @brief Flash Security Disable command handler.
void handle_flash_security_disable(uint8_t *packet, uint32_t packetLength)
{
    flash_security_disable_packet_t *command = (flash_security_disable_packet_t *)packet;

    status_t status = kStatus_Success;
#if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
#if !BL_DEVICE_IS_LPC_SERIES
    // Flash interface wants little endian, so just send two uint32s.
    // Note: Both Main and Secondary flash share the same security control
    //  So it doesn't matter what index of allFlashState[] we use for this FLASH API.
    status = g_bootloaderContext.flashDriverInterface->flash_security_bypass(g_bootloaderContext.allFlashState,
                                                                             (uint8_t *)&command->keyLow);
#endif // !BL_DEVICE_IS_LPC_SERIES
#endif

    send_generic_response(status, command->commandPacket.commandTag);
}
#endif // !BL_FEATURE_HAS_NO_INTERNAL_FLASH

#if 0
//! @brief  Flash Program Once command handler
void handle_flash_program_once(uint8_t *packet, uint32_t length)
{
    flash_program_once_packet_t *command = (flash_program_once_packet_t *)packet;

    status_t status = kStatus_Success;

    lock_acquire();
#if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
#if !BL_DEVICE_IS_LPC_SERIES
    // Note: Both Main and Secondary flash share the same IFR Memory
    //  So it doesn't matter what index of allFlashState[] we use for this FLASH API.
    status = g_bootloaderContext.flashDriverInterface->flash_program_once(
        &g_bootloaderContext.allFlashState->ftfxConfig[kFlashIndex_Main], command->index, (uint8_t *)&command->data[0],
        command->byteCount);
#endif // !BL_DEVICE_IS_LPC_SERIES
#elif BL_FEATURE_OCOTP_MODULE
    status = ocotp_program_once(OCOTP, command->index, &command->data[0], command->byteCount);
    if (status == kStatus_Success)
    {
        uint32_t programData = command->data[0];
        uint32_t readData = 0;

        status = ocotp_read_once(OCOTP, command->index, &readData, command->byteCount);
        if (status == kStatus_Success)
        {
            if (programData != (readData & programData))
            {
                status = kStatus_OCOTP_ProgramFailure;
            }
        }
    }
#elif defined(BL_DEVICE_IS_LPC_SERIES) && defined(OTP_API)
    status = ocotp_program_once(command->index, &command->data[0], command->byteCount);
#elif BL_FEATURE_EDGELOCK_MODULE
    status = EDGELOCK_WriteFuse(SxMU, command->index * 32 /* word bits */, command->byteCount * 8 /* byte bits */,
                                false /* Not lock*/, &command->data[0], command->byteCount / sizeof(uint32_t));
#endif // #if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
    lock_release();

    send_generic_response(status, command->commandPacket.commandTag);
}
#endif // if 0

#if 0
//! @brief  Flash Read Once command handler
void handle_flash_read_once(uint8_t *packet, uint32_t length)
{
    flash_read_once_packet_t *command = (flash_read_once_packet_t *)packet;

#if BL_FEATURE_EDGELOCK_MODULE
    uint32_t readOnceItemData[READ_COMMON_FUSE_RESPONSE_MAX_WORDS] = { 0 };
#else
    uint32_t readOnceItemData[2] = { 0 };
#endif

    status_t status = kStatus_Success;

    lock_acquire();
#if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
#if !BL_DEVICE_IS_LPC_SERIES
    // Note: Both Main and Secondary flash share the same IFR Memory
    //  So it doesn't matter what index of allFlashState[] we use for this FLASH API.
    status = g_bootloaderContext.flashDriverInterface->flash_read_once(
        &g_bootloaderContext.allFlashState->ftfxConfig[kFlashIndex_Main], command->index,
        (uint8_t *)&readOnceItemData[0], command->byteCount);
#endif // !BL_DEVICE_IS_LPC_SERIES
#elif BL_FEATURE_OCOTP_MODULE
    status = ocotp_read_once(OCOTP, command->index, &readOnceItemData[0], command->byteCount);
#elif defined(BL_DEVICE_IS_LPC_SERIES) && defined(OTP_API)
    status = ocotp_read_once(command->index, &readOnceItemData[0], command->byteCount);
#elif BL_FEATURE_EDGELOCK_MODULE
    status = EDGELOCK_ReadFuse(SxMU, command->index, &readOnceItemData[0], command->byteCount / sizeof(uint32_t));
#endif // #if !BL_FEATURE_HAS_NO_INTERNAL_FLASH
    lock_release();

    send_flash_read_once_response(status, readOnceItemData, command->byteCount);
}

//! @brief  Flash Read Resource command handler
void handle_flash_read_resource(uint8_t *packet, uint32_t length)
{
    flash_read_resource_packet_t *command = (flash_read_resource_packet_t *)packet;

    // Start the data phase.
    reset_data_phase();
    g_bootloaderContext.commandInterface->stateData->dataPhase.count = command->byteCount;
    g_bootloaderContext.commandInterface->stateData->dataPhase.address = command->startAddress;
    g_bootloaderContext.commandInterface->stateData->dataPhase.commandTag = kCommandTag_FlashReadResource;
    g_bootloaderContext.commandInterface->stateData->dataPhase.option = (uint8_t)command->option;
    send_flash_read_resource_response(kStatus_Success, command->byteCount);
}
#endif // if 0

//! @brief Send a generic response packet.
void send_generic_response(uint32_t commandStatus, uint32_t commandTag)
{
    generic_response_packet_t responsePacket;
    responsePacket.commandPacket.commandTag = kCommandTag_GenericResponse;
    responsePacket.commandPacket.flags = 0;
    responsePacket.commandPacket.reserved = 0;
    responsePacket.commandPacket.parameterCount = 2;
    responsePacket.status = commandStatus;
    responsePacket.commandTag = commandTag;

