iwasz/mcuxsdk-middleware-bootloader/src/bootloader/src/bl_command_MKE17Z512.c
    status_t status = g_bootloaderContext.activePeripheral->packetInterface->writePacket(
        g_bootloaderContext.activePeripheral, (const uint8_t *)&responsePacket, sizeof(responsePacket),
        kPacketType_Command);
//    if (status != kStatus_Success)
//    {
//        debug_printf("Error: writePacket returned status 0x%x\r\n", status);
//    }
}

//! @brief Send a get property response packet.
void send_get_property_response(uint32_t commandStatus, uint32_t *value, uint32_t numValues)
{
    get_property_response_packet_t responsePacket;
    responsePacket.commandPacket.commandTag = kCommandTag_GetPropertyResponse;
    responsePacket.commandPacket.flags = 0;
    responsePacket.commandPacket.reserved = 0;
    responsePacket.commandPacket.parameterCount = 1 + numValues; // status + value words
    responsePacket.status = commandStatus;

    for (uint32_t i = 0; i < numValues; ++i)
    {
        responsePacket.propertyValue[i] = value[i];
    }

    uint32_t packetSize =
        sizeof(responsePacket.commandPacket) + (responsePacket.commandPacket.parameterCount * sizeof(uint32_t));

    status_t status = g_bootloaderContext.activePeripheral->packetInterface->writePacket(
        g_bootloaderContext.activePeripheral, (const uint8_t *)&responsePacket, packetSize, kPacketType_Command);
//    if (status != kStatus_Success)
//    {
//        debug_printf("Error: writePacket returned status 0x%x\r\n", status);
//    }
}


#if BL_FEATURE_GEN_KEYBLOB
//! @brief Send a read memory response packet.
void send_generate_key_blob_response(uint32_t commandStatus, uint32_t length)
{
    generate_key_blob_response_packet_t responsePacket;
    responsePacket.commandPacket.commandTag = kCommandTag_GenerateKeyBlobResponse;
    responsePacket.commandPacket.flags = kCommandFlag_HasDataPhase;
    responsePacket.commandPacket.reserved = 0;
    responsePacket.commandPacket.parameterCount = 2;
    responsePacket.status = commandStatus;
    responsePacket.dataByteCount = length;

    status_t status = g_bootloaderContext.activePeripheral->packetInterface->writePacket(
        g_bootloaderContext.activePeripheral, (const uint8_t *)&responsePacket, sizeof(responsePacket),
        kPacketType_Command);
    if (status != kStatus_Success)
    {
        debug_printf("Error: writePacket returned status 0x%x\r\n", status);
    }
}
#endif

//! @brief Send a read memory response packet.
void send_read_memory_response(uint32_t commandStatus, uint32_t length)
{
    read_memory_response_packet_t responsePacket;
    responsePacket.commandPacket.commandTag = kCommandTag_ReadMemoryResponse;
    responsePacket.commandPacket.flags = kCommandFlag_HasDataPhase;
    responsePacket.commandPacket.reserved = 0;
    responsePacket.commandPacket.parameterCount = 2;
    responsePacket.status = commandStatus;
    responsePacket.dataByteCount = length;

    status_t status = g_bootloaderContext.activePeripheral->packetInterface->writePacket(
        g_bootloaderContext.activePeripheral, (const uint8_t *)&responsePacket, sizeof(responsePacket),
        kPacketType_Command);
//    if (status != kStatus_Success)
//    {
//        debug_printf("Error: writePacket returned status 0x%x\r\n", status);
//    }
}

//! @brief Send a flash read once resposne packet.
void send_flash_read_once_response(uint32_t commandStatus, uint32_t *value, uint32_t byteCount)
{
    flash_read_once_response_packet_t responsePacket;
    responsePacket.commandPacket.commandTag = kCommandTag_FlashReadOnceResponse;
    responsePacket.commandPacket.flags = 0;
    responsePacket.commandPacket.reserved = 0;
    responsePacket.commandPacket.parameterCount = 2; // always includes two parameters: status and byte count
    responsePacket.status = commandStatus;

    if (commandStatus == kStatus_Success)
    {
        responsePacket.commandPacket.parameterCount += byteCount / sizeof(uint32_t); // add parameter: data
        responsePacket.byteCount = byteCount;
        memcpy(responsePacket.data, value, byteCount);
    }
    else
    {
        responsePacket.byteCount = 0;
    }

    uint32_t packetSize =
        sizeof(responsePacket.commandPacket) + (responsePacket.commandPacket.parameterCount * sizeof(uint32_t));

    status_t status = g_bootloaderContext.activePeripheral->packetInterface->writePacket(
        g_bootloaderContext.activePeripheral, (const uint8_t *)&responsePacket, packetSize, kPacketType_Command);
    if (status != kStatus_Success)
    {
        debug_printf("Error: writePacket returned status 0x%x\r\n", status);
    }
}

//! @brief Send a flash read resource memory response packet.
void send_flash_read_resource_response(uint32_t commandStatus, uint32_t length)
{
    flash_read_resource_response_packet_t responsePacket;
    responsePacket.commandPacket.commandTag = kCommandTag_FlashReadResourceResponse;
    responsePacket.commandPacket.flags = kCommandFlag_HasDataPhase;
    responsePacket.commandPacket.reserved = 0;
    responsePacket.commandPacket.parameterCount = 2;
    responsePacket.status = commandStatus;
    responsePacket.dataByteCount = length;

    status_t status = g_bootloaderContext.activePeripheral->packetInterface->writePacket(
        g_bootloaderContext.activePeripheral, (const uint8_t *)&responsePacket, sizeof(responsePacket),
        kPacketType_Command);
    if (status != kStatus_Success)
    {
        debug_printf("Error: writePacket returned status 0x%x\r\n", status);
    }
}

#if BL_FEATURE_KEY_PROVISIONING
#if defined(BL_FEATURE_KEY_STORE_PUF) && BL_FEATURE_KEY_STORE_PUF
//! @brief Key Provisioning command handler.
void handle_key_provisioning(uint8_t *packet, uint32_t packetLength)
{
    status_t status = kStatus_Success;

    key_provisioning_packet_t *command = (key_provisioning_packet_t *)packet;
    uint32_t operation = command->operation;
    bool isDataPhaseRequired = false;
    uint32_t memoryId = kMemoryInternal;
    uint8_t *keyStoreAddress = NULL;
    uint32_t keyStoreSize = 0;

    g_bootloaderContext.commandInterface->stateData->dataPhase.option = kCmd_DataPhase_Option_Skip;
    switch (operation)
    {
        case kKeyProvisioning_Operation_Enroll:
            status = key_store_enroll();
            break;
        case kKeyProvisioning_Operation_SetUserKey:
            isDataPhaseRequired = true;
            if (command->size > BL_FEATURE_KEY_STORE_MAX_KEY_SIZE)
            {
                status = kStatus_InvalidArgument;
                break;
            }
            // Start the data phase.
            reset_data_phase();
            g_bootloaderContext.commandInterface->stateData->dataPhase.commandTag = kCommandTag_KeyProvisioning;
            g_bootloaderContext.commandInterface->stateData->dataPhase.count = command->size;
            g_bootloaderContext.commandInterface->stateData->dataPhase.address = (uint32_t)&s_userKeyBuffer;
            g_bootloaderContext.commandInterface->stateData->dataPhase.option = kCmd_DataPhase_Option_Consumer;
            g_bootloaderContext.commandInterface->stateData->dataPhase.argument0 = command->operation;
            g_bootloaderContext.commandInterface->stateData->dataPhase.argument1 = command->type;
            g_bootloaderContext.commandInterface->stateData->dataPhase.argument2 = command->size;
            break;
        case kKeyProvisioning_Operation_SetIntrinsicKey:
            status = key_store_set_key(NULL, command->size, command->type);
            break;
        case kKeyProvisioning_Operation_WriteNonVolatile:
            memoryId = command->type;
            status = key_store_write_nonvolatile(memoryId);
            break;
        case kKeyProvisioning_Operation_ReadNonVolatile:
            memoryId = command->type;
            status = key_store_read_nonvolatile(memoryId);
            break;
        case kKeyProvisioning_Operation_WriteKeyStore:
            isDataPhaseRequired = true;
            // Start the data phase.
            reset_data_phase();
            g_bootloaderContext.commandInterface->stateData->dataPhase.commandTag = kCommandTag_KeyProvisioning;
            g_bootloaderContext.commandInterface->stateData->dataPhase.count = sizeof(s_userKeyStoreBuffer);
            g_bootloaderContext.commandInterface->stateData->dataPhase.address = (uint32_t)s_userKeyStoreBuffer;
            g_bootloaderContext.commandInterface->stateData->dataPhase.option = kCmd_DataPhase_Option_Consumer;
            g_bootloaderContext.commandInterface->stateData->dataPhase.argument0 = command->operation;
            break;
        case kKeyProvisioning_Operation_ReadKeyStore:
            isDataPhaseRequired = true;
            reset_data_phase();
            status = key_store_get(&keyStoreAddress, &keyStoreSize);
            if (status == kStatus_Success)
            {
                // Start the data phase only when key store is available.
                g_bootloaderContext.commandInterface->stateData->dataPhase.commandTag = kCommandTag_KeyProvisioning;
                g_bootloaderContext.commandInterface->stateData->dataPhase.count = keyStoreSize;
                g_bootloaderContext.commandInterface->stateData->dataPhase.address = (uint32_t)keyStoreAddress;
                g_bootloaderContext.commandInterface->stateData->dataPhase.option = kCmd_DataPhase_Option_Producer;
            }
            break;
        default:
            status = kStatus_InvalidArgument;
    }

    if (isDataPhaseRequired)
    {
        send_key_provisioning_response(status, g_bootloaderContext.commandInterface->stateData->dataPhase.count);
    }
    else
    {
        send_generic_response(status, command->commandPacket.commandTag);
    }
}

//! @brief Send a key provisioning response packet.
void send_key_provisioning_response(uint32_t commandStatus, uint32_t length)
{
    read_memory_response_packet_t responsePacket;
    responsePacket.commandPacket.commandTag = kCommandTag_KeyProvisioningResponse;
    responsePacket.commandPacket.flags = kCommandFlag_HasDataPhase;
    responsePacket.commandPacket.reserved = 0;
    responsePacket.commandPacket.parameterCount = 2;
    responsePacket.status = commandStatus;
    responsePacket.dataByteCount = length;

