iwasz/mcuxsdk-middleware-bootloader/src/bootloader/src/bl_command_MKE17Z512.c
    status_t status = g_bootloaderContext.activePeripheral->packetInterface->writePacket(
        g_bootloaderContext.activePeripheral, (const uint8_t *)&responsePacket, sizeof(responsePacket),
        kPacketType_Command);
    if (status != kStatus_Success)
    {
        debug_printf("Error: writePacket returned status 0x%x\r\n", status);
    }
}
#else
//! @brief Key Provisioning command handler.
void handle_key_provisioning(uint8_t *packet, uint32_t packetLength)
{
    status_t status = kStatus_Success;

    key_provisioning_packet_t *command = (key_provisioning_packet_t *)packet;
    uint32_t operation = command->operation;
    bool isDataPhaseRequired = false;
    skboot_key_metadata_t keyMetaData = { .keyType = kPUF_KeyType_Invalid };
    uint32_t memoryId = kMemoryInternal;

    g_bootloaderContext.commandInterface->stateData->dataPhase.option = kCmd_DataPhase_Option_Skip;
    switch (operation)
    {
        case kKeyProvisioning_Operation_Enroll:
            status = skboot_key_secretbox_enroll();
            break;
        case kKeyProvisioning_Operation_SetUserKey:
            isDataPhaseRequired = true;
            if (command->size > kPUF_KeySizeMax)
            {
                status = kStatus_InvalidArgument;
                break;
            }
            // Start the data phase.
            reset_data_phase();
            g_bootloaderContext.commandInterface->stateData->dataPhase.commandTag = kCommandTag_KeyProvisioning;
            g_bootloaderContext.commandInterface->stateData->dataPhase.count = command->size;
            g_bootloaderContext.commandInterface->stateData->dataPhase.address = (uint32_t)&s_userKeyBuffer;
            g_bootloaderContext.commandInterface->stateData->dataPhase.option = kCmd_DataPhase_Option_Consumer;
            g_bootloaderContext.commandInterface->stateData->dataPhase.argument0 = command->operation;
            g_bootloaderContext.commandInterface->stateData->dataPhase.argument1 = command->type;
            g_bootloaderContext.commandInterface->stateData->dataPhase.argument2 = command->size;
            break;
        case kKeyProvisioning_Operation_SetIntrinsicKey:
            keyMetaData.keyType = (skboot_key_type_t)command->type;
            status = skboot_key_secretbox(NULL, command->size, &keyMetaData);
            break;
        case kKeyProvisioning_Operation_WriteNonVolatile:
            memoryId = command->type;
            status = skboot_hal_key_secretbox_write_to_nonvolatile(memoryId);
            break;
        case kKeyProvisioning_Operation_ReadNonVolatile:
            // uint32_t memoryId = command->type;
            // status = skboot_hal_key_secretbox_read_to_nonvolatile();
            break;
        case kKeyProvisioning_Operation_WriteKeyStore:
            isDataPhaseRequired = true;
            // Start the data phase.
            reset_data_phase();
            g_bootloaderContext.commandInterface->stateData->dataPhase.commandTag = kCommandTag_KeyProvisioning;
            g_bootloaderContext.commandInterface->stateData->dataPhase.count = sizeof(*s_keyStore);
            g_bootloaderContext.commandInterface->stateData->dataPhase.address = (uint32_t)s_keyStore;
            g_bootloaderContext.commandInterface->stateData->dataPhase.option = kCmd_DataPhase_Option_Consumer;
            break;
        case kKeyProvisioning_Operation_ReadKeyStore:
            isDataPhaseRequired = true;
            // Start the data phase.
            reset_data_phase();
            g_bootloaderContext.commandInterface->stateData->dataPhase.commandTag = kCommandTag_KeyProvisioning;
            g_bootloaderContext.commandInterface->stateData->dataPhase.count = sizeof(*s_keyStore);
            g_bootloaderContext.commandInterface->stateData->dataPhase.address = (uint32_t)s_keyStore;
            g_bootloaderContext.commandInterface->stateData->dataPhase.option = kCmd_DataPhase_Option_Producer;
            break;
        default:
            status = kStatus_InvalidArgument;
    }

    switch (status)
    {
        case kStatus_SKBOOT_Success:
            status = kStatus_Success;
            break;
        case kStatus_SKBOOT_Fail:
            status = kStatus_Fail;
            break;
        case kStatus_SKBOOT_InvalidArgument:
            status = kStatus_InvalidArgument;
            break;
        default:
            break; // No change.
    }

    if (isDataPhaseRequired)
    {
        send_key_provisioning_response(status, g_bootloaderContext.commandInterface->stateData->dataPhase.count);
    }
    else
    {
        send_generic_response(status, command->commandPacket.commandTag);
    }
}

//! @brief Send a key provisioning response packet.
void send_key_provisioning_response(uint32_t commandStatus, uint32_t length)
{
    read_memory_response_packet_t responsePacket;
    responsePacket.commandPacket.commandTag = kCommandTag_KeyProvisioningResponse;
    responsePacket.commandPacket.flags = kCommandFlag_HasDataPhase;
    responsePacket.commandPacket.reserved = 0;
    responsePacket.commandPacket.parameterCount = 2;
    responsePacket.status = commandStatus;
    responsePacket.dataByteCount = length;

    status_t status = g_bootloaderContext.activePeripheral->packetInterface->writePacket(
        g_bootloaderContext.activePeripheral, (const uint8_t *)&responsePacket, sizeof(responsePacket),
        kPacketType_Command);
    if (status != kStatus_Success)
    {
        debug_printf("Error: writePacket returned status 0x%x\r\n", status);
    }
}
#endif // BL_FEATURE_KEY_STORE_PUF
#endif // BL_FEATURE_KEY_PROVISIONING

#if BL_FEATURE_LIFECYCLE_UPDATE
void handle_lifecycle_update(uint8_t *packet, uint32_t packetLength)
{
    lifecycle_update_packet_t *command = (lifecycle_update_packet_t *)packet;

    status_t status = kStatus_Success;

#if BL_FEATURE_EDGELOCK_MODULE
    status = EDGELOCK_ForwardLifecycleUpdate(SxMU, command->lifecycle);
#else
#error unknown module
#endif

    send_generic_response(status, command->commandPacket.commandTag);
}
#endif // #if BL_FEATURE_LIFECYCLE_UPDATE

#if BL_FEATURE_EDGELOCK_MODULE
void handle_ele_message(uint8_t *packet, uint32_t packetLength)
{
    status_t status = kStatus_InvalidArgument;
    ele_message_payload *command = (ele_message_payload *)packet;

    if (command->eleSubCommand == 0x0 && command->cmdMsgAddr && command->cmdMsgCnt)
    {
        status = EDGELOCK_SendMessage(SxMU, (uint32_t *)command->cmdMsgAddr, command->cmdMsgCnt);
        if (status == kStatus_Success && command->respMsgCnt > 0)
        {
            status = EDGELOCK_ReceiveMessage(SxMU, (uint32_t *)command->respMsgAddr, command->respMsgCnt);
        }
    }
    send_generic_response(status, command->commandPacket.commandTag);
}
#endif // #if BL_FEATURE_EDGELOCK_MODULE
//! @}

////////////////////////////////////////////////////////////////////////////////
// EOF
////////////////////////////////////////////////////////////////////////////////
